#include <stdio.h>

int main(void)
{
	int a;

	scanf("%d", &a);								//여기서 변수 a에 값 입력
	printf("입력된 값 : %d\n", a);					//입력한 값 출력

/*----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	int age;
	double height;

	printf("나이와 키를 입력하세요: ");
	scanf(" %d%lf", &age, &height);
	printf("나이는 %d살, 키는 %.1lfcm입니다\n", age, height);

/*----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	char grade;
	char name[20];

	printf("학점 입력 :");
	scanf("%c", &grade);
	printf("이름 입력: ");
	scanf("%s", name);												//scanf함수라도 문자열에는 &를 안붙여도 됨!!!

	printf("%s의 학점은 %c입니다\n", name, grade);

	return 0;
}