#include <stdio.h>
int main(void)
{

	/* 대입, 덧셈, 뺄셈, 곱셈, 음수 연산*/

	int a, b;
	int sum, sub, mul, inv;

	a = 10;
	b = 20;
	sum = a + b;
	sub = a - b;
	mul = a * b;
	inv = -a;

	printf("a의 값 : %d, b의 값: %d\n", a, b);
	printf("덧셈 : %d\n", sum);
	printf("뺄셈 : %d\n", sub);
	printf("곳셈 : %d\n", mul);
	printf("a의 음수 연산 : %d\n", inv);

	/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	/* 몫과 나머지를 구하는 연산 */

	double apple;
	int banana;
	int orange;

	apple = 5.0 / 2.0;
	banana = 5 / 2;
	orange = 5 % 2;

	printf("apple : %.1lf\n", apple);
	printf("banna : %d\n", banana);
	printf("orange : %d\n", orange);

	/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	/* 증감 연산자의 연산 */

	int k = 10, f = 10;

	++k;							// 증감연산자 ++k = k+1
	--f;							// 증감연산자 --f = f-1

	printf("k: %d\n", k);
	printf("f: %d\n", f);

	/*-------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	/* 전위 표기와 후위 표기를 사용한 증감 연산 */

	int c = 5, g = 5;
	int pre, post;

	pre = (++c) * 3;
	post = (g++) * 3;

	printf("초깃값 c = %d, g = %d\n", c, g);
	printf("전위형 (++c) * 3 = %d, 후위형: (g++)*3= %d\n", pre, post);

	/*------------------------------------------------------------------------------------------------------------------------------------------------------------*/

	/* 관계 연산의 결괏값 확인 */

	int q = 10, w = 20, e= 10;
	int res;
	
	// 참이면 결괏값이 1, 거짓이면 결괏값이 0으로 표현된다!!

	res = (q > w);
	printf("q>w: %d\n", res);
	res = (q >= w);
	printf("q>=w : %d\n", res);
	res=(q < w);
	printf("q<w: %d\n", res);
	res = (q <= w);
	printf("q<=w: %d\n", res);
	res = (q <= e);
	printf("q<=e: %d\n", res);
	res = (q == w);
	printf("q==w: %d\n", res);
	res = (q != e);
	printf("q!=e: %d\n", res);

/*----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/* 논리 연산의 결괏값 확인 */
/* && = and, || = or, ! = NOT */
	int y = 30;
	int mes;

	mes = (y > 10) && (y < 20);
	printf("(y>10)&&(y<20): %d\n", mes);
	mes = (y < 10) || (y > 20);
	printf("(y < 10) || (y > 20): %d\n", mes);
	mes = !(y >= 30);
	printf("!(y >= 30): %d\n", mes);

/*----------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/* 연산의 결괏값을 사용하는 방법 */

	int i = 10, o = 20, fes;

	i + o;
	printf("%d + %d = %d\n", i, o, i + o);

	fes = i + o;
	printf(" % d + % d = % d\n", i, o, fes);


	return 0;
}